[
    {
        "hadith": "Hadith 1: Actions Are By Intentions\n\nOn the authority of the Commander of the Faithful, Abu Hafs Umar ibn al-Khattab (may Allah be pleased with him), who said: I heard the Messenger of Allah (peace be upon him) say: \"Actions are only by intentions, and every person will have only what they intended. So whoever's emigration was to Allah and His Messenger, then their emigration was to Allah and His Messenger. And whoever's emigration was for worldly gain or to marry a woman, then their emigration was for what they emigrated for.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith establishes the fundamental principle that the validity and reward of all deeds depend on the intention behind them. It teaches that sincerity is essential in worship, and that the same outward action can have vastly different values depending on one's intention. A person will be rewarded only according to what they truly intended, not merely by their external actions."
    },
    {
        "hadith": "Hadith 2: The Hadith of Jibreel\n\nOn the authority of Umar (may Allah be pleased with him), who said: While we were sitting with the Messenger of Allah (peace be upon him) one day, a man appeared before us with extremely white clothes and extremely black hair. No signs of travel could be seen on him, and none of us recognized him. He sat down before the Prophet (peace be upon him), resting his knees against his knees and placing his palms on his thighs, and said: \"O Muhammad, tell me about Islam.\" The Messenger of Allah said: \"Islam is to testify that there is no god but Allah and that Muhammad is the Messenger of Allah, to establish prayer, to give zakat, to fast Ramadan, and to perform Hajj to the House if you are able.\" He said: \"You have spoken the truth.\" We were amazed that he asked and then confirmed. He said: \"Tell me about Iman (faith).\" He said: \"It is to believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in divine decree, both good and bad.\" He said: \"You have spoken the truth.\" He said: \"Tell me about Ihsan (excellence).\" He said: \"It is to worship Allah as if you see Him, and if you do not see Him, He surely sees you.\" He said: \"Tell me about the Hour.\" He said: \"The one asked knows no more than the one asking.\" He said: \"Then tell me about its signs.\" He said: \"That the slave-girl will give birth to her mistress, and that you will see barefoot, naked, destitute shepherds competing in constructing tall buildings.\" Then he departed, and I stayed for a while. Then the Prophet said: \"O Umar, do you know who the questioner was?\" I said: \"Allah and His Messenger know best.\" He said: \"It was Jibreel, who came to teach you your religion.\" (Narrated by Muslim)",
        "description": "This comprehensive hadith, known as the Hadith of Jibreel, defines the three dimensions of the religion: Islam (submission through outward acts), Iman (inner faith and beliefs), and Ihsan (spiritual excellence). It serves as a foundational text that outlines the essential beliefs and practices of the Muslim faith, and reminds us that we are always in Allah's sight."
    },
    {
        "hadith": "Hadith 3: The Five Pillars of Islam\n\nOn the authority of Abu Abdur-Rahman Abdullah ibn Umar ibn al-Khattab (may Allah be pleased with them both), who said: I heard the Messenger of Allah (peace be upon him) say: \"Islam is built upon five: testifying that there is no god but Allah and that Muhammad is the Messenger of Allah, establishing prayer, giving zakat, performing Hajj to the House, and fasting Ramadan.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith presents Islam as a structure built on five essential pillars. Like a building that requires all its pillars to stand firm, a Muslim's practice of Islam is incomplete without these five foundational acts of worship. Each pillar serves a specific purpose in developing one's relationship with Allah and with fellow human beings."
    },
    {
        "hadith": "Hadith 4: The Creation of a Human Being\n\nOn the authority of Abu Abdur-Rahman Abdullah ibn Masud (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him), the truthful and trustworthy, told us: \"Verily the creation of each one of you is brought together in his mother's womb for forty days as a drop, then he becomes a clot for a similar period, then a morsel for a similar period. Then the angel is sent to him and breathes the soul into him, and is commanded to write four things: his provision, his lifespan, his deeds, and whether he will be wretched or blessed. By Allah, other than Whom there is no god, one of you may do the deeds of the people of Paradise until there is only an arm's length between him and it, then what is written overtakes him and he does the deeds of the people of the Fire and enters it. And one of you may do the deeds of the people of the Fire until there is only an arm's length between him and it, then what is written overtakes him and he does the deeds of the people of Paradise and enters it.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith describes the stages of human development in the womb and establishes the reality of divine decree. It teaches that our ultimate fate depends not on the quantity of our deeds, but on their end and the state of our hearts. It warns against complacency and encourages perseverance in good deeds until the very end of life."
    },
    {
        "hadith": "Hadith 5: Rejection of Innovation\n\nOn the authority of the Mother of the Believers, Umm Abdullah Aisha (may Allah be pleased with her), who said: The Messenger of Allah (peace be upon him) said: \"Whoever introduces into this affair of ours that which is not from it, it is rejected.\" (Narrated by Bukhari and Muslim) In another narration from Muslim: \"Whoever does an action that is not in accordance with this matter of ours, it is rejected.\"",
        "description": "This hadith establishes that religious innovations (bid'ah) that have no basis in the Quran and Sunnah are rejected and unacceptable. Any act of worship must be based on authentic religious sources. This principle protects the purity of Islamic practice and prevents people from adding to or altering the religion based on personal preferences."
    },
    {
        "hadith": "Hadith 6: The Lawful and Unlawful Are Clear\n\nOn the authority of Abu Abdullah al-Numan ibn Bashir (may Allah be pleased with them both), who said: I heard the Messenger of Allah (peace be upon him) say: \"The lawful is clear and the unlawful is clear, and between them are doubtful matters about which many people do not know. So whoever avoids the doubtful matters has protected his religion and his honor. And whoever falls into the doubtful matters falls into the unlawful, like a shepherd who grazes around a sanctuary, all but grazing therein. Truly every king has a sanctuary, and truly Allah's sanctuary is His prohibitions. Truly in the body there is a morsel of flesh which, if it is sound, the whole body is sound, and if it is corrupt, the whole body is corrupt. Truly it is the heart.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith teaches that most religious rulings are clear, but there are areas of ambiguity. The wise Muslim avoids doubtful matters to protect their faith. The hadith uses the metaphor of a shepherd near forbidden pasture and emphasizes the central role of the heart in determining one's spiritual state and actions."
    },
    {
        "hadith": "Hadith 7: Religion Is Sincere Advice\n\nOn the authority of Tamim al-Dari (may Allah be pleased with him), that the Prophet (peace be upon him) said: \"Religion is sincere advice.\" We said: \"To whom?\" He said: \"To Allah, His Book, His Messenger, the leaders of the Muslims, and their common folk.\" (Narrated by Muslim)",
        "description": "This concise hadith summarizes the essence of religion as nasihah (sincere advice and well-wishing). It encompasses our duties toward Allah through proper worship, toward the Quran through learning and following it, toward the Prophet through following his Sunnah, toward Muslim leaders through obedience in good, and toward fellow Muslims through good counsel and support."
    },
    {
        "hadith": "Hadith 8: The Inviolability of a Muslim\n\nOn the authority of Ibn Umar (may Allah be pleased with them both), that the Messenger of Allah (peace be upon him) said: \"I have been ordered to fight against people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, and establish prayer, and give zakat. If they do that, their blood and property are protected from me except by the right of Islam, and their account is with Allah the Exalted.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith establishes that the declaration of faith grants protection of life and property. Once a person becomes Muslim, they are granted full rights in the Muslim community. Their internal state and sincerity is between them and Allah, and Muslims are required to deal with the outward appearance of faith."
    },
    {
        "hadith": "Hadith 9: The Basis of Islam\n\nOn the authority of Abu Hurairah Abdur-Rahman ibn Sakhr (may Allah be pleased with him), who said: I heard the Messenger of Allah (peace be upon him) say: \"What I have forbidden for you, avoid. What I have ordered you to do, do as much of it as you can. For verily, it was only their excessive questioning and their disagreeing with their Prophets that destroyed those before you.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith establishes a fundamental principle: prohibitions must be completely avoided, while commands should be followed to the best of one's ability. The hadith also warns against excessive questioning and disputing with divine commands, as this was a cause of destruction for previous nations."
    },
    {
        "hadith": "Hadith 10: The Acceptance of Pure Deeds\n\nOn the authority of Abu Hurairah (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) said: \"Allah the Almighty is Good and accepts only that which is good. Allah has commanded the believers to do that which He commanded the Messengers, and the Almighty has said: 'O Messengers, eat from the pure foods and work righteousness.' And the Almighty has said: 'O you who believe, eat from the pure things which We have provided you.' Then he mentioned a man who, having journeyed far, is disheveled and dusty, spreading out his hands to the sky saying: 'O Lord! O Lord!' while his food is unlawful, his drink is unlawful, his clothing is unlawful, and he is nourished unlawfully. So how can he be answered?\" (Narrated by Muslim)",
        "description": "This hadith emphasizes that Allah only accepts what is pure and lawful. It warns that consuming unlawful provisions affects the acceptance of one's supplications. A person's earnings, food, drink, and clothing all influence their spiritual state and the acceptance of their worship."
    },
    {
        "hadith": "Hadith 11: Avoiding the Doubtful\n\nOn the authority of Abu Muhammad al-Hasan ibn Ali ibn Abi Talib, the grandson of the Messenger of Allah (peace be upon him) and his beloved (may Allah be pleased with them both), who said: I memorized from the Messenger of Allah (peace be upon him): \"Leave that which makes you doubt for that which does not make you doubt.\" (Narrated by Tirmidhi and Nasai)",
        "description": "This hadith provides practical guidance for dealing with uncertain situations. When in doubt about whether something is permissible or forbidden, the safe path is to leave it and choose what is clearly permissible. This principle helps develop taqwa (God-consciousness) and protects one from falling into sin."
    },
    {
        "hadith": "Hadith 12: Leaving What Does Not Concern You\n\nOn the authority of Abu Hurairah (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) said: \"Part of the perfection of a person's Islam is leaving that which does not concern him.\" (Narrated by Tirmidhi)",
        "description": "This hadith teaches that a sign of good faith is to focus on what truly matters and avoid meddling in affairs that don't concern you. This includes avoiding gossip, unnecessary curiosity about others' affairs, and wasting time on frivolous matters. A believer should invest their time and energy in beneficial pursuits."
    },
    {
        "hadith": "Hadith 13: Loving for Your Brother\n\nOn the authority of Abu Hamzah Anas ibn Malik (may Allah be pleased with him), the servant of the Messenger of Allah (peace be upon him), that the Prophet (peace be upon him) said: \"None of you truly believes until he loves for his brother what he loves for himself.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith establishes the principle of brotherhood in Islam and the importance of selflessness. True faith requires that we wish for others the same good that we wish for ourselves. This principle, if applied, would eliminate envy, selfishness, and all forms of ill-treatment toward others."
    },
    {
        "hadith": "Hadith 14: The Sanctity of Muslim Blood\n\nOn the authority of Ibn Masud (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) said: \"The blood of a Muslim who testifies that there is no god but Allah and that I am the Messenger of Allah is not lawful except in three cases: a life for a life, the married person who commits adultery, and one who forsakes his religion and separates from the community.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith establishes the sanctity of Muslim life and that taking a Muslim's life is only permissible in three specific cases determined by Islamic law: as punishment for murder, for adultery by a married person, and for apostasy coupled with treason. This highlights how seriously Islam takes the protection of human life."
    },
    {
        "hadith": "Hadith 15: Good Conduct\n\nOn the authority of Abu Hurairah (may Allah be pleased with him), that the Messenger of Allah (peace be upon him) said: \"Let him who believes in Allah and the Last Day speak good or remain silent. Let him who believes in Allah and the Last Day be generous to his neighbor. Let him who believes in Allah and the Last Day be generous to his guest.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith links true faith with good conduct in three key areas: speech, treatment of neighbors, and hospitality to guests. A believer should either speak what is beneficial or remain silent, avoiding harmful or useless talk. The hadith emphasizes the practical manifestation of faith through considerate behavior toward others."
    },
    {
        "hadith": "Hadith 16: Do Not Get Angry\n\nOn the authority of Abu Hurairah (may Allah be pleased with him), that a man said to the Prophet (peace be upon him): \"Advise me.\" He said: \"Do not get angry.\" The man repeated his request several times, and each time the Prophet said: \"Do not get angry.\" (Narrated by Bukhari)",
        "description": "This hadith highlights the destructive nature of anger and the importance of controlling it. The Prophet's repeated advice to avoid anger shows how comprehensive this advice is, as anger leads to many sins including violence, injustice, and broken relationships. Controlling anger is a sign of true strength and leads to many other virtues."
    },
    {
        "hadith": "Hadith 17: Excellence in Everything\n\nOn the authority of Abu Ya'la Shaddad ibn Aws (may Allah be pleased with him), that the Messenger of Allah (peace be upon him) said: \"Verily Allah has prescribed excellence (ihsan) in all things. So if you kill, kill in a good manner, and if you slaughter, slaughter in a good manner. Let each of you sharpen his blade and spare suffering to the animal he is slaughtering.\" (Narrated by Muslim)",
        "description": "This hadith establishes the principle that Islam requires excellence and kindness in all actions, even in matters that might seem harsh. Slaughter is used as an example because if kindness is required even in taking a life, then it is certainly required in all other actions. This reflects Islam's comprehensive approach to mercy and excellence."
    },
    {
        "hadith": "Hadith 18: Taqwa and Good Character\n\nOn the authority of Abu Dharr Jundub ibn Junadah and Abu Abdur-Rahman Mu'adh ibn Jabal (may Allah be pleased with them both), that the Messenger of Allah (peace be upon him) said: \"Fear Allah wherever you are, and follow up a bad deed with a good one and it will wipe it out, and behave well towards people.\" (Narrated by Tirmidhi)",
        "description": "This hadith provides three comprehensive pieces of advice: to maintain God-consciousness at all times, to immediately follow any sin with good deeds to erase it, and to treat people with excellent character. These three principles, if followed, would transform one's spiritual and social life."
    },
    {
        "hadith": "Hadith 19: Be Mindful of Allah\n\nOn the authority of Abu Abbas Abdullah ibn Abbas (may Allah be pleased with them both), who said: One day I was riding behind the Prophet (peace be upon him) when he said: \"Young man, I will teach you some words. Be mindful of Allah and He will protect you. Be mindful of Allah and you will find Him before you. If you ask, ask Allah. If you seek help, seek help from Allah. Know that if the whole nation were to gather together to benefit you with something, they would not benefit you with anything except what Allah had already written for you. And if they were to gather together to harm you with something, they would not harm you with anything except what Allah had already written against you. The pens have been lifted and the pages have dried.\" (Narrated by Tirmidhi)",
        "description": "This profound advice to Ibn Abbas contains fundamental lessons about tawakkul (trust in Allah) and the reality of divine decree. It teaches that our protection comes from Allah, that we should turn to Him alone in supplication, and that nothing happens except by His will. This brings peace and confidence to the believer's heart."
    },
    {
        "hadith": "Hadith 20: Modesty\n\nOn the authority of Abu Masud Uqbah ibn Amr al-Ansari al-Badri (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) said: \"Among the words people obtained from the early prophets is: If you feel no shame, do whatever you wish.\" (Narrated by Bukhari)",
        "description": "This hadith emphasizes the role of modesty (haya) as a moral compass. It can be understood in two ways: as a statement that modesty prevents one from doing wrong, or as a warning that without shame, a person will do whatever they want without restraint. Modesty is described by the Prophet as a branch of faith."
    },
    {
        "hadith": "Hadith 21: Steadfastness in Faith\n\nOn the authority of Abu Amr, or Abu Amrah, Sufyan ibn Abdullah (may Allah be pleased with him), who said: I said: \"O Messenger of Allah, tell me something about Islam which I can ask of no one but you.\" He said: \"Say: 'I believe in Allah,' and then be steadfast.\" (Narrated by Muslim)",
        "description": "This hadith provides a concise formula for success in religion: declaration of faith followed by steadfastness (istiqamah). True faith requires not just saying words, but following through with consistent righteous action. Steadfastness means remaining firm on the straight path despite challenges and temptations."
    },
    {
        "hadith": "Hadith 22: The Path to Paradise\n\nOn the authority of Abu Abdullah Jabir ibn Abdullah al-Ansari (may Allah be pleased with them both), that a man asked the Messenger of Allah (peace be upon him): \"Tell me, if I pray the obligatory prayers, fast Ramadan, treat the lawful as lawful and the forbidden as forbidden, and do nothing more than that, will I enter Paradise?\" He said: \"Yes.\" (Narrated by Muslim)",
        "description": "This hadith shows the mercy of Allah and the accessibility of Paradise. By fulfilling the basic obligations and avoiding prohibitions, a person can attain Paradise. This provides hope and encouragement, especially for those who may not be able to do many voluntary acts of worship."
    },
    {
        "hadith": "Hadith 23: Purity is Half of Faith\n\nOn the authority of Abu Malik al-Harith ibn Asim al-Ashari (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) said: \"Purification is half of faith. Saying 'al-hamdu lillah' fills the scales. Saying 'subhan Allah' and 'al-hamdu lillah' fill what is between the heavens and the earth. Prayer is light. Charity is proof. Patience is illumination. The Quran is evidence for or against you. Every person goes out in the morning and sells their soul, either freeing it or causing its ruin.\" (Narrated by Muslim)",
        "description": "This hadith mentions several important acts of worship and their rewards. Purification (taharah) both physical and spiritual forms the foundation of worship. The hadith emphasizes the weight of dhikr (remembrance of Allah), the virtue of prayer, charity, patience, and the Quran, concluding with a reminder that each person determines their own fate through their daily choices."
    },
    {
        "hadith": "Hadith 24: Allah Has Forbidden Oppression\n\nOn the authority of Abu Dharr al-Ghifari (may Allah be pleased with him), from the Prophet (peace be upon him) from his Lord (blessed and exalted), that He said: \"O My servants, I have forbidden oppression for Myself and have made it forbidden amongst you, so do not oppress one another. O My servants, all of you are astray except those whom I guide, so seek guidance from Me and I will guide you. O My servants, all of you are hungry except those whom I feed, so seek food from Me and I will feed you. O My servants, all of you are naked except those whom I clothe, so seek clothing from Me and I will clothe you. O My servants, you sin by day and by night, and I forgive all sins, so seek forgiveness from Me and I will forgive you. O My servants, you can neither harm Me nor benefit Me. O My servants, if the first of you and the last of you, the humans of you and the jinn of you, were all as pious as the most pious heart of any individual amongst you, that would not increase My kingdom an iota. O My servants, if the first of you and the last of you, the humans of you and the jinn of you, were all as wicked as the most wicked heart of any individual amongst you, that would not decrease My kingdom an iota. O My servants, if the first of you and the last of you, the humans of you and the jinn of you, were all to stand together in one place and ask of Me, and I were to give everyone what they asked, that would not decrease what I have any more than a needle decreases the ocean when dipped into it. O My servants, it is but your deeds that I account for you, then I recompense you for them. So whoever finds good, let him praise Allah, and whoever finds other than that, let him blame only himself.\" (Narrated by Muslim)",
        "description": "This sacred hadith (hadith qudsi) is one of the most comprehensive statements about Allah's relationship with His creation. It establishes Allah's absolute justice, His prohibition of oppression, humanity's complete dependence on Him, the vastness of His forgiveness, His self-sufficiency, and our personal responsibility for our deeds."
    },
    {
        "hadith": "Hadith 25: The Reward of Good Deeds\n\nOn the authority of Abu Dharr (may Allah be pleased with him): Some people from amongst the companions of the Messenger of Allah (peace be upon him) said to the Prophet: \"O Messenger of Allah, the affluent have taken the rewards. They pray as we pray, fast as we fast, and give charity from their excess wealth.\" He said: \"Has not Allah made for you things with which you can give charity? Truly every tasbeehah (saying 'subhan Allah') is charity, every takbeerah (saying 'Allahu akbar') is charity, every tahmeedah (saying 'al-hamdu lillah') is charity, every tahleelah (saying 'la ilaha illa Allah') is charity, enjoining good is charity, forbidding evil is charity, and in the private relations of each of you there is charity.\" They said: \"O Messenger of Allah, when one of us fulfills his desire, is there reward in that?\" He said: \"Do you not see that if he were to act upon it unlawfully, he would have sin? Likewise, if he acts upon it lawfully, he will have reward.\" (Narrated by Muslim)",
        "description": "This hadith shows that opportunities for reward are available to everyone, not just the wealthy. Every good deed, from simple words of remembrance to fulfilling one's desires in a lawful manner, is counted as charity. Islam provides equal opportunity for spiritual reward regardless of material wealth."
    },
    {
        "hadith": "Hadith 26: Charity for Every Joint\n\nOn the authority of Abu Hurairah (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) said: \"Each joint of a person must perform a charity every day the sun rises: to judge justly between two people is charity; to help a man with his mount, lifting him onto it or hoisting his belongings onto it, is charity; a good word is charity; each step you take toward prayer is charity; and removing a harmful thing from the road is charity.\" (Narrated by Bukhari and Muslim)",
        "description": "This hadith teaches that every person has a daily obligation of gratitude for each blessing, including the joints of their body. It shows that charity extends far beyond monetary giving to include all forms of good deeds that benefit others, even something as simple as removing an obstacle from a path."
    },
    {
        "hadith": "Hadith 27: Righteousness and Sin\n\nOn the authority of al-Nawwas ibn Sam'an (may Allah be pleased with him), that the Prophet (peace be upon him) said: \"Righteousness is good character, and sin is that which wavers in your heart and which you dislike people finding out about.\" (Narrated by Muslim) On the authority of Wabisah ibn Ma'bad (may Allah be pleased with him), who said: I came to the Messenger of Allah (peace be upon him) and he said: \"You have come to ask about righteousness.\" I said: \"Yes.\" He said: \"Consult your heart. Righteousness is that about which the soul feels at ease and the heart feels tranquil. And sin is that which wavers in the soul and causes uneasiness in the chest, even if people give you their opinion in its favor.\" (Narrated by Ahmad and Darimi)",
        "description": "These narrations define righteousness as good character and inner peace, while sin is marked by inner discomfort and the desire to hide one's actions. The natural conscience, when properly cultivated, can distinguish between right and wrong. This internal guidance system complements the external guidance of Islamic law."
    },
    {
        "hadith": "Hadith 28: Follow the Sunnah\n\nOn the authority of Abu Najih al-Irbad ibn Sariyah (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) gave us a sermon by which our hearts were filled with fear and tears came to our eyes. So we said: \"O Messenger of Allah, it is as though this is a farewell sermon, so advise us.\" He said: \"I advise you to fear Allah, and to listen and obey, even if a slave becomes your leader. Verily, whoever among you lives will see much disagreement. So adhere to my Sunnah and the Sunnah of the rightly-guided caliphs after me. Hold firmly to it and bite onto it with your molars. And beware of newly invented matters, for every newly invented matter is an innovation, and every innovation is a going astray, and every going astray is in the Fire.\" (Narrated by Abu Dawud and Tirmidhi)",
        "description": "This hadith is a comprehensive advice given by the Prophet about adhering to the Quran and Sunnah, particularly in times of disagreement. It emphasizes obedience to legitimate authority, following the way of the Prophet and his rightly-guided successors, and avoiding religious innovations that have no basis in revelation."
    },
    {
        "hadith": "Hadith 29: Gates to Good\n\nOn the authority of Mu'adh ibn Jabal (may Allah be pleased with him), who said: I said: \"O Messenger of Allah, tell me of an action which will take me into Paradise and keep me away from the Fire.\" He said: \"You have asked about a great matter, yet it is easy for whomever Allah makes it easy. You should worship Allah, associating nothing with Him; establish prayer; pay the zakat; fast Ramadan; and make pilgrimage to the House.\" Then he said: \"Shall I not guide you to the gates of good? Fasting is a shield; charity extinguishes sin as water extinguishes fire; and the prayer of a man in the depths of the night.\" Then he recited: 'Their sides forsake their beds, calling upon their Lord in fear and hope, and they spend from what We have provided them. No soul knows what has been hidden for them of comfort for eyes as reward for what they used to do.' Then he said: \"Shall I not tell you of the head of the matter, its pillar and its peak?\" I said: \"Yes, O Messenger of Allah.\" He said: \"The head of the matter is Islam, its pillar is prayer, and its peak is jihad.\" Then he said: \"Shall I not tell you of the foundation of all that?\" I said: \"Yes, O Messenger of Allah.\" So he took hold of his tongue and said: \"Restrain this.\" I said: \"O Prophet of Allah, will we be taken to account for what we say with it?\" He said: \"May your mother be bereaved of you, O Mu'adh! Is there anything that throws people into the Fire on their faces, or on their noses, except the harvests of their tongues?\" (Narrated by Tirmidhi)",
        "description": "This comprehensive hadith outlines the path to Paradise, including obligatory and voluntary acts of worship. It emphasizes the importance of the five pillars, night prayer, and most critically, controlling the tongue. The Prophet identifies the tongue as the primary cause of people being thrown into Hell."
    },
    {
        "hadith": "Hadith 30: The Limits of Allah\n\nOn the authority of Abu Tha'labah al-Khushani Jurthum ibn Nashir (may Allah be pleased with him), that the Messenger of Allah (peace be upon him) said: \"Verily Allah the Exalted has obligated obligations, so do not neglect them. He has set limits, so do not exceed them. He has prohibited some things, so do not violate them. And He has remained silent about some things, out of mercy to you, not forgetfulness, so do not seek after them.\" (Narrated by Daraqutni)",
        "description": "This hadith categorizes religious rulings: obligations that must be fulfilled, limits that must not be exceeded, prohibitions that must not be violated, and matters left unaddressed which are permitted. This last category teaches that silence in the texts indicates permissibility and that we should not create restrictions where none exist."
    },
    {
        "hadith": "Hadith 31: True Asceticism\n\nOn the authority of Abu Abbas Sahl ibn Sa'd al-Sa'idi (may Allah be pleased with him), who said: A man came to the Prophet (peace be upon him) and said: \"O Messenger of Allah, direct me to an action which, if I do it, Allah will love me and people will love me.\" He said: \"Be abstinent in this world and Allah will love you. Be abstinent toward what people possess and people will love you.\" (Narrated by Ibn Majah)",
        "description": "This hadith provides a simple formula for gaining Allah's love and the love of people: avoid excessive attachment to worldly things and avoid coveting what others have. True asceticism (zuhd) is not about abandoning the world entirely, but about not letting worldly desires control the heart."
    },
    {
        "hadith": "Hadith 32: No Harm\n\nOn the authority of Abu Sa'id Sa'd ibn Malik ibn Sinan al-Khudri (may Allah be pleased with him), that the Messenger of Allah (peace be upon him) said: \"There should be neither harm nor reciprocal harm.\" (Narrated by Ibn Majah and Daraqutni)",
        "description": "This concise hadith establishes a fundamental legal principle: one should neither cause harm to others nor respond to harm with equal harm. This principle serves as a basis for many Islamic rulings and prohibits any action that causes unjustified harm to oneself or others."
    },
    {
        "hadith": "Hadith 33: The Burden of Proof\n\nOn the authority of Ibn Abbas (may Allah be pleased with them both), that the Messenger of Allah (peace be upon him) said: \"If people were given according to their claims, they would claim the lives and property of others. But the burden of proof is upon the claimant, and the oath is upon the one who denies.\" (Narrated by Bayhaqi)",
        "description": "This hadith establishes a fundamental legal principle: the burden of proof lies with the one making a claim, while the defendant need only take an oath of denial. This prevents chaos and injustice that would result if mere claims were sufficient to take others' property or lives."
    },
    {
        "hadith": "Hadith 34: Changing Evil\n\nOn the authority of Abu Sa'id al-Khudri (may Allah be pleased with him), who said: I heard the Messenger of Allah (peace be upon him) say: \"Whoever among you sees an evil, let him change it with his hand. If he is unable to do so, then with his tongue. If he is unable to do so, then with his heart, and that is the weakest of faith.\" (Narrated by Muslim)",
        "description": "This hadith establishes the duty of enjoining good and forbidding evil according to one's capacity. It provides a hierarchy of methods: physical action, verbal objection, and at minimum, disapproval in the heart. The last option, while the weakest, represents the absolute minimum requirement of faith when one cannot do more."
    },
    {
        "hadith": "Hadith 35: Brotherhood in Islam\n\nOn the authority of Abu Hurairah (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) said: \"Do not envy one another, do not artificially inflate prices against one another, do not hate one another, do not turn away from one another, do not undercut one another in business transactions. Be, O slaves of Allah, brothers. The Muslim is the brother of the Muslim: he does not wrong him, he does not fail him, he does not lie to him, he does not belittle him. Piety is here,\" and he pointed to his chest three times. \"It is enough evil for a person to hold his Muslim brother in contempt. The entire Muslim is inviolable to another Muslim: his blood, his property, and his honor.\" (Narrated by Muslim)",
        "description": "This hadith outlines the comprehensive rights of Muslims upon each other and prohibits actions that harm brotherhood. It forbids envy, hatred, deception, and all forms of harm to fellow Muslims' dignity, property, or life. True piety is measured by one's treatment of others, not mere outward acts."
    },
    {
        "hadith": "Hadith 36: Relieving a Believer's Distress\n\nOn the authority of Abu Hurairah (may Allah be pleased with him), that the Prophet (peace be upon him) said: \"Whoever relieves a believer of one of the distresses of this world, Allah will relieve him of one of the distresses of the Day of Resurrection. Whoever makes things easy for one in difficulty, Allah will make things easy for him in this world and the next. Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and the next. Allah helps the servant as long as the servant helps his brother. Whoever follows a path seeking knowledge, Allah makes his path to Paradise easy. No people gather in a house from the houses of Allah, reciting the Book of Allah and studying it together, except that tranquility descends upon them, mercy envelops them, angels surround them, and Allah mentions them to those with Him. Whoever is slowed down by his deeds will not be hastened by his lineage.\" (Narrated by Muslim)",
        "description": "This hadith highlights the rewards for helping others and seeking knowledge. Relief of others' distress, easing difficulties, concealing faults, and helping fellow Muslims are all rewarded in kind by Allah. It also emphasizes the virtue of gathering for religious learning and that good deeds, not lineage, determine one's rank."
    },
    {
        "hadith": "Hadith 37: Good and Bad Deeds Multiplied\n\nOn the authority of Ibn Abbas (may Allah be pleased with them both), that the Messenger of Allah (peace be upon him), from what he relates from his Lord (blessed and exalted), said: \"Verily Allah has written down the good deeds and the bad deeds, then He clarified it: whoever intends a good deed and does not do it, Allah writes it down as a complete good deed. If he intends it and does it, Allah writes it down as from ten good deeds to seven hundred times, to many times more. If he intends a bad deed and does not do it, Allah writes it down as a complete good deed. If he intends it and does it, Allah writes it down as one bad deed.\" (Narrated by Bukhari and Muslim)",
        "description": "This sacred hadith demonstrates Allah's infinite mercy and justice. Good intentions are rewarded even without action, and good deeds are multiplied manifold. Bad intentions are not punished until acted upon, and even then, the punishment is proportionate. This system strongly encourages good and discourages evil."
    },
    {
        "hadith": "Hadith 38: The Allies of Allah\n\nOn the authority of Abu Hurairah (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him) said: \"Allah the Exalted has said: 'Whoever takes a friend of Mine as an enemy, I declare war upon him. My servant does not draw near to Me with anything more beloved to Me than what I have made obligatory upon him. My servant continues to draw near to Me with voluntary acts until I love him. When I love him, I become his hearing with which he hears, his sight with which he sees, his hand with which he strikes, and his foot with which he walks. If he asks Me, I will surely give him. If he seeks refuge in Me, I will surely protect him. I do not hesitate about anything as I hesitate about taking the soul of a believer: he hates death and I hate to harm him.'\" (Narrated by Bukhari)",
        "description": "This profound sacred hadith describes the path to becoming a beloved servant of Allah. It begins with fulfilling obligatory duties, then progressing to voluntary acts until Allah loves the servant. Allah then assists the servant in all their faculties. This hadith also shows Allah's special care for believers, even at the time of death."
    },
    {
        "hadith": "Hadith 39: Forgiveness for Mistakes\n\nOn the authority of Ibn Abbas (may Allah be pleased with them both), that the Messenger of Allah (peace be upon him) said: \"Verily Allah has overlooked for my nation their mistakes, what they forget, and what they are forced to do.\" (Narrated by Ibn Majah and Bayhaqi)",
        "description": "This hadith demonstrates Allah's mercy toward this nation. Unintentional mistakes, genuine forgetfulness, and actions done under compulsion are forgiven. This removes unnecessary burden and hardship from believers while still holding them accountable for deliberate sins."
    },
    {
        "hadith": "Hadith 40: Be in the World as a Stranger\n\nOn the authority of Ibn Umar (may Allah be pleased with them both), who said: The Messenger of Allah (peace be upon him) took hold of my shoulder and said: \"Be in the world as if you were a stranger or a traveler.\" Ibn Umar used to say: \"When you reach the evening, do not expect to reach the morning. When you reach the morning, do not expect to reach the evening. Take from your health for your sickness and from your life for your death.\" (Narrated by Bukhari)",
        "description": "This hadith teaches detachment from worldly life, viewing it as a temporary journey rather than a permanent home. A traveler takes only what is necessary and focuses on reaching their destination. The advice of Ibn Umar emphasizes living each day fully, preparing for death, and utilizing health and time before they are gone."
    },
    {
        "hadith": "Hadith 41: Following the Prophet\n\nOn the authority of Abu Muhammad Abdullah ibn Amr ibn al-As (may Allah be pleased with them both), who said: The Messenger of Allah (peace be upon him) said: \"None of you truly believes until his desires are in accordance with what I have brought.\" (Narrated by al-Baghawi in Sharh al-Sunnah)",
        "description": "This hadith establishes that complete faith requires submission of one's desires and preferences to the teachings of the Prophet. True belief means following Islamic guidance even when it conflicts with personal preferences. This hadith addresses the internal aspect of faith - the alignment of the heart's desires with divine guidance."
    },
    {
        "hadith": "Hadith 42: The Vastness of Allah's Mercy\n\nOn the authority of Anas (may Allah be pleased with him), who said: I heard the Messenger of Allah (peace be upon him) say: \"Allah the Exalted has said: 'O son of Adam, as long as you call upon Me and have hope in Me, I will forgive you for what you have done and I do not mind. O son of Adam, if your sins were to reach the clouds of the sky and then you sought forgiveness from Me, I would forgive you. O son of Adam, if you were to come to Me with sins nearly as great as the earth and then met Me without associating anything with Me, I would bring you forgiveness nearly as great as it.'\" (Narrated by Tirmidhi)",
        "description": "This final hadith concludes the collection with a powerful message of hope. No matter how great one's sins, Allah's mercy is greater still. The conditions are sincere supplication, hope in Allah, seeking forgiveness, and not associating partners with Him. This encourages sinners never to despair of Allah's mercy and to always return to Him in repentance."
    }
]